# Analytical functions

In [1]:
%load_ext sql
%sql oracle+cx_oracle://hr:oracle@srv2.lan:1521/free

Connecting to 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

In [2]:
%%sql
SELECT
   C.region_id, 
   MAX(R.region_name) AS region
   ,LISTAGG(C.country_name, ', ') 
   WITHIN GROUP (ORDER BY C.country_name) AS LIST
FROM countries C 
LEFT JOIN regions R ON C.region_id = R.region_id  
GROUP BY C.region_id

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-----------+----------+--------------------------------------------------------------------------------------------------------------------------+
| region_id |  region  |                                                           list                                                           |
+-----------+----------+--------------------------------------------------------------------------------------------------------------------------+
|     10    |  Europe  | Belgium, Denmark, France, Germany, Italy, Netherlands, Switzerland, United Kingdom of Great Britain and Northern Ireland |
|     20    | Americas |                               Argentina, Brazil, Canada, Mexico, United States of America                                |
|     30    |   Asia   |                                 China, India, Israel, Japan, Kuwait, Malaysia, Singapore                                 |
|     40    | Oceania  |                                                        Australia                                                         |
|     50    |  Africa  |                                             Egypt, Nigeria, Zambia, Zimbabwe                                             |
+-----------+----------+--------------------------------------------------------------------------------------------------------------------------+

## Over + listagg
Req: Oracle 21c
Apply the function over all rows with the same partition key as this row

In [ ]:
%%sql
SELECT 
  country_name,
  region_id,
  LISTAGG(country_name, ', ') 
    WITHIN GROUP (ORDER BY country_name) 
    OVER (PARTITION BY region_id) 
    AS countries_in_region 
FROM countries
WHERE REGION_ID = 50

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------------+-----------+----------------------------------+
| country_name | region_id |       countries_in_region        |
+--------------+-----------+----------------------------------+
|    Egypt     |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
|   Nigeria    |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
|    Zambia    |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
|   Zimbabwe   |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
+--------------+-----------+----------------------------------+

In [7]:
%load_ext sql
%sql oracle+cx_oracle://co:oracle@srv2.lan:1521/free

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'oracle+cx_oracle://co:***@srv2.lan:1521/free'

In [17]:
%%sql
SELECT 
shipment_id,
CUSTOMER_ID,
DELIVERY_ADDRESS,
COUNT(1) OVER() total_system,
COUNT (1) OVER (PARTITION BY CUSTOMER_ID) customer_shipments,
ROUND(
  100.0 * COUNT(CASE WHEN SHIPMENT_STATUS = 'DELIVERED' THEN 1 END)
  OVER (PARTITION BY CUSTOMER_ID)
  / COUNT(*) OVER (PARTITION BY CUSTOMER_ID),
  2
) AS customer_delivery_ratio
,
-- 21c
COUNT(DISTINCT DELIVERY_ADDRESS) 
OVER (PARTITION BY CUSTOMER_ID) AS cust_distinct_addr
FROM SHIPMENTS

Running query in 'oracle+cx_oracle://co:***@srv2.lan:1521/free'

+-------------+-------------+------------------------+--------------+--------------------+-------------------------+--------------------+
| shipment_id | customer_id |    delivery_address    | total_system | customer_shipments | customer_delivery_ratio | cust_distinct_addr |
+-------------+-------------+------------------------+--------------+--------------------+-------------------------+--------------------+
|     1669    |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     1670    |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     241     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     301     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     274     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     300     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     273     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|      5      |      2      | Spencer, MA 01562 USA  |     1892     |         2          |           100           |         1          |
|      4      |      2      | Spencer, MA 01562 USA  |     1892     |         2          |           100           |         1          |
|     1046    |      3      | Webster, MA 01570 USA  |     1892     |         11         |           100           |         1          |
+-------------+-------------+------------------------+--------------+--------------------+-------------------------+--------------------+
Truncated to displaylimit of 10.

## First value
- be careful with last_value function

In [18]:
%%sql
SELECT 
order_id,
customer_id,
count(*) over (partition by customer_id) as count,
first_value(TO_CHAR(order_tms, 'YYYY-MM-DD') || ', id: '||order_id ) over (partition by customer_id order by order_tms desc) as newest,
first_value(TO_CHAR(order_tms, 'YYYY-MM-DD') || ', id: '||order_id )  over (partition by customer_id order by order_tms asc) as oldest,
listagg(TO_CHAR(order_tms, 'YYYY-MM-DD') || ', id: '||order_id , ' | ' ) over (partition by customer_id) as checks
FROM orders

Running query in 'oracle+cx_oracle://co:***@srv2.lan:1521/free'

+----------+-------------+-------+----------------------+---------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| order_id | customer_id | count |        newest        |        oldest       |                                                                                                         checks                                                                                                         |
+----------+-------------+-------+----------------------+---------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|   1491   |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   1390   |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   201    |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   182    |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   159    |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   765    |      2      |   2   | 2021-09-09, id: 765  |  2021-02-11, id: 5  |                                                                                        2021-09-09, id: 765 | 2021-02-11, id: 5                                                                                         |
|    5     |      2      |   2   | 2021-09-09, id: 765  |  2021-02-11, id: 5  |                                                                                        2021-09-09, id: 765 | 2021-02-11, id: 5                                                                                         |
|   1520   |      3      |   10  | 2022-01-20, id: 1520 |  2021-02-04, id: 1  | 2022-01-20, id: 1520 | 2021-09-22, id: 832 | 2021-09-09, id: 766 | 2021-08-11, id: 608 | 2021-07-27, id: 544 | 2021-05-27, id: 307 | 2021-05-24, id: 298 | 2021-03-22, id: 63 | 2021-03-01, id: 20 | 2021-02-04, id: 1 |
|   832    |      3      |   10  | 2022-01-20, id: 1520 |  2021-02-04, id: 1  | 2022-01-20, id: 1520 | 2021-09-22, id: 832 | 2021-09-09, id: 766 | 2021-08-11, id: 608 | 2021-07-27, id: 544 | 2021-05-27, id: 307 | 2021-05-24, id: 298 | 2021-03-22, id: 63 | 2021-03-01, id: 20 | 2021-02-04, id: 1 |
|   766    |      3      |   10  | 2022-01-20, id: 1520 |  2021-02-04, id: 1  | 2022-01-20, id: 1520 | 2021-09-22, id: 832 | 2021-09-09, id: 766 | 2021-08-11, id: 608 | 2021-07-27, id: 544 | 2021-05-27, id: 307 | 2021-05-24, id: 298 | 2021-03-22, id: 63 | 2021-03-01, id: 20 | 2021-02-04, id: 1 |
+----------+-------------+-------+----------------------+---------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.